/**************************************************************************//**
	@file		Title.h
	@brief		タイトルのシーケンスクラス		定義ファイル	
	@author		K.Seto
	@date		2011-11-4
	@par		[説明]
				ゲームのタイトル画面のシーケンス
				格難易度のゲームプレイやゲームないの説明書のシーケンスに移動するボタンを表示する。
*//***************************************************************************/
#ifndef INCLUDE_SEQUENCE_TITLE_H
#define INCLUDE_SEQUENCE_TITLE_H

#include "Child.h"
#include "ofMain.h"
#include <vector>
#include <string>

/////////////////////////////////////////////////
/// Forward Declaration
class Mouse;
class Materials;
class ClickButton;

namespace Sequence{
	class Parent;

	/**********************************************************************//**
		@class		Title
		@brief		タイトルのシーケンスクラス
		@par		[説明]
	*//***********************************************************************/
	class Title : public Child {
		public:
			/////////////////////////////////////////////////
			/// Public Function
			/**********************************************************************//**
				@brief		コンストラクタ
				@return		なし
				@note
				@par		
			*//***********************************************************************/
			Title();

			/**********************************************************************//**
				@brief		デストラクタ
				@return		なし
				@note
				@par		
			*//***********************************************************************/
			virtual ~Title();

			/**********************************************************************//**
				@brief		更新関数
				@param[in]	Parent * pParent		シーケンス親クラスのポインタ	
				@return		更新後のシーケンス
				@note
				@par		シーケンス移動があった場合は
							更新後のシーケンスに次のシーケンスクラスのポインタを返す。
			*//***********************************************************************/
			Child* Update( Parent* pParent );

			Child* _GetNextSequence();

			/**********************************************************************//**
				@brief		描画関数	
				@return		なし
				@note
				@par		ゲーム難易度の選択、ゲーム説明シーケンス移動の
							ボタンの表示
			*//***********************************************************************/
			void Draw();

			/**********************************************************************//**
				@brief		ボタンの描画関数
				@return		なし
				@note
				@par		
			*//***********************************************************************/
			void _DrawButtons();

	private:
			/////////////////////////////////////////////////
			/// Private Function
			/**********************************************************************//**
				@brief		BGMを再生する
				@return		なし
				@note
				@par		
			*//***********************************************************************/
			void _PlayBgm();

			/**********************************************************************//**
				@brief		タイトルメニューに表示されtるボタンを初期化する
				@return		なし
				@note
				@par		
			*//***********************************************************************/
			void _InitializeButtons();

			/**********************************************************************//**
				@brief		ボタンのインスタンスを開放する
				@return		なし
				@note
				@par		
			*//***********************************************************************/
			void _FinalizeButtons();

			/**********************************************************************//**
				@brief		ボタンの更新関数
				@return		なし
				@note
				@par		
			*//***********************************************************************/
			void _UpdateButtons();

			/////////////////////////////////////////////////
			/// Private Variable
			Mouse* m_pMouse;
			Materials* m_pMaterials;

			ClickButton* m_pClickButtonGame;
			ClickButton* m_pClickButtonEasy;
			ClickButton* m_pClickButtonNormal;
			ClickButton* m_pClickButtonHard;
			ClickButton* m_pClickButtonHowto;
			ofImage m_titleImage;
	};
};


#endif
