/**************************************************************************//**
	@file		MotionTween.h
	@brief		初期位置から目的位置までの座標を補間するクラス 定義ファイル		
	@author		K.Seto
	@date		2011-10-22 
	@par		[説明]
				モーショントゥイーンクラス
				初期位置と目的地と速度（フレーム数）を指定すると
				その経過フレーム数に応じた座標を補完してその値を返す機能を持つ。
				オブジェクトの位置をスムーズに移動させたいときに使う。
*//***************************************************************************/

#ifndef INCLUDE_MOVEMENT_H
#define INCLUDE_MOVEMENT_H

/**********************************************************************//**
	@class		MotionTween
	@brief		初期位置から目的位置までの座標を補間するクラス
	@par		[説明]
*//***********************************************************************/
class MotionTween
{
    public:
		//////////////////////////////////////////////////////////////////////////
		// Public Function

        /**********************************************************************//**
        	@brief		コンストラクタ
        	@return		なし
        	@par		初期座標を（０，０）設定		
        *//***********************************************************************/
        MotionTween();

        /**********************************************************************//**
        	@brief		デストラクタ
        	@return		なし
        *//***********************************************************************/
        virtual ~MotionTween();

        /**********************************************************************//**
        	@brief		更新関数
        	@return		なし
        *//***********************************************************************/
        void Update();

        /**********************************************************************//**
        	@brief		移動が終了したかどうか？
        	@retval		ture	移動が終了している
        	@retval		false	移動が終了していない
        *//***********************************************************************/
        bool IsFinished()const;
        // 目標地点を設定する、指定のフレーム数で到着する
        /**********************************************************************//**
        	@brief		目的地の座標を設定する
        	@param[in]	targetPosX		目的地のX座標
        	@param[in]	targetPosY		目的地のY座標	
        	@param[in]	targetFrame		目的地に到着するまでのフレーム数
        	@return		なし
        	@par		ただし目的地というのは初期座標の（０，０）座標から移動後の座標のことを指している。
        *//***********************************************************************/
        void SetTarget(int targetPosX, int targetPosY, int targetFrame);

        /**********************************************************************//**
        	@brief		現在の座標をリセットし初期座標（０，０）に設定する
        	@return		なし		
        	@par		
        *//***********************************************************************/
        void Reset();

        /**********************************************************************//**
        	@brief		現在のX座標を返す
        	@return		なし
        *//***********************************************************************/
        int GetCurrentPosX() const;

        /**********************************************************************//**
        	@brief		現在のY座標を返す
        	@return		なし
        *//***********************************************************************/
        int GetCurrentPosY() const;
    private:
		//////////////////////////////////////////////////////////////////////////
		// Private Variable
        int m_targetPosX;	//<! 目的地のX座標
        int m_targetPosY;	//<! 目的地のY座標
        int m_posX;			//<! 現在のX座標
        int m_posY;			//<! 現在のY座標
        int m_currentFrame;	//<! 現在の経過フレーム数
        int m_targetFrame;	//<! 移動終了時のフレーム数
};

#endif // INCLUDE_MOVEMENT_H
