/**************************************************************************//**
	@file		PairImages.h
	@brief		ofImageポインタの二枚セットのデータクラス	定義ファイル	
	@author		K.Seto
	@date		2011-10-26 
	@par		[説明]
				画像クラスのポインタを保持しているだけデータクラス
				ポインタは外部から設定されるのでメモリを開放する必要はない。

*//***************************************************************************/


#ifndef PAIRIMAGES_H
#define PAIRIMAGES_H

#include "ofMain.h"

/**********************************************************************//**
	@class		PairImages
	@brief		ofImageの二枚セットのクラス
	@par		[説明]
				ofImageはopenFrameworksに組み込まれている画像クラスである。
				その画像クラスポインタをペアにしたクラス
*//***********************************************************************/
class PairImages
{
    public:
        //////////////////////////////////////////////////////////////////////////
		// Public Function

        /**********************************************************************//**
        	@brief		コンストラクタ		
        	@param[in]	ofImage * pImageFirst	一枚目の画像クラスポインタ
        	@param[in]	ofImage * pImageSecond	二枚目の画像クラスポインタ
        	@return		なし
        *//***********************************************************************/
        PairImages(ofImage* pFirstImage, ofImage* pSecondImage);

        /**********************************************************************//**
        	@brief		デストラクタ
        	@return		なし
        *//***********************************************************************/
        virtual ~PairImages();

        /**********************************************************************//**
        	@brief		画像のペアをセットアップする
        	@param[in]	ofImage * pImageFirst
        	@param[in]	ofImage * pImageSecond
        	@return		なし
        	@note
        	@par		// TODO: これはイニシャライズ関数にしたほうがいいかもしれない	
        *//***********************************************************************/
        void SetPairIamge(ofImage* pFirstImage, ofImage* pSecondImage);

        /**********************************************************************//**
        	@brief		一枚目の画像ポインタを取得する
        	@return		一枚目の画像ポインタ
        	@note
        	@par		
        *//***********************************************************************/
        ofImage* GetFirstImage();
        /**********************************************************************//**
        	@brief		二枚目の画像ポインタを取得する
        	@return		二枚目の画像ポインタ
        	@note
        	@par		
        *//***********************************************************************/
        ofImage* GetSecondImage();
    private:
		//////////////////////////////////////////////////////////////////////////
		// Private Variable
        ofImage* m_pFirstImage;		//<! 一枚目の画像ポインタ 
        ofImage* m_pSecondImage;	//<! 二枚目の画像ポインタ

};

#endif // DUPLEX_H
